20240324T120408--kdoc-127-chromeのpdfビューワでしおりを使う__essay.org
:properties:
:ID: 20240324T120408
:end:
#+title:      KDOC 127: ChromeのPDFビューワでしおりを使う
#+date:       [2024-03-24 Sun 12:04]
#+filetags:   :essay:
#+identifier: 20240324T120408

* この文書のステータス
- 作成
  - [X] 2024-03-24 貴島
- レビュー
  - [X] 2024-04-27 貴島

* 概要
本はPDFで買うようにしていて、PDFはPCのブラウザ(Google Chrome)で読んでいる[fn:1]。

1つ問題があって、リロードするとページがリセットされる。最初からになるので、ブラウザを閉じるときはページ番号をメモしたりしていた。不意にPCを再起動したりすると、どこまで読んだかわからなくなっていた。

最近見つけた解決策は、URLフラグメント ~#~ をつけるものだ。URLの末尾に ~#page=31~ をつけると、ChromeがPDFのそのページを開いてくれる。

たとえば、↓PDFをChromeで開くと10ページで開く。

- https://mozilla.github.io/pdf.js/web/compressed.tracemonkey-pldi-09.pdf#page=10 👈末尾に注目

また、ズーム率もURLフラグメントで設定できる。

https://mozilla.github.io/pdf.js/web/compressed.tracemonkey-pldi-09.pdf#page=10&zoom=150

* 関連
なし。

* Footnotes
[fn:1] 複数開くのをタブにまとめられて便利くらいの理由。
