20240324T120408--kdoc-127-chromeのpdfビューワでしおりを使う__essay.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2024-07-31 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>KDOC 127: ChromeのPDFビューワでしおりを使う</title>
<meta name="generator" content="Org mode">
<meta name="author" content="root">
<link rel='shortcut icon' type='image/x-icon' href='/roam/favicon.ico' /><link rel='stylesheet' href='https://cdn.jsdelivr.net/npm/bootstrap@5.0.2/dist/css/bootstrap.min.css' /><link rel='stylesheet' href='https://cdnjs.cloudflare.com/ajax/libs/font-awesome/5.15.4/css/all.min.css' /><link rel='stylesheet' href='../css/site.css' /><link rel='stylesheet' href='../roam/css/code.css' /><link rel='stylesheet' href='css/site.css' /><link rel='stylesheet' href='css/code.css' />
</head>
<body>
<div id="preamble" class="status">
<div><div class="header"><div class="container"><div class="row"><div class="col-sm-12 col-md-12"><nav class="navbar navbar-light"/></div></div></div></div></div>
</div>
<div id="content">
<h1 class="title">KDOC 127: ChromeのPDFビューワでしおりを使う</h1>

<div id="outline-container-org1ba969d" class="outline-2">
<h2 id="org1ba969d"><a href="#org1ba969d">この文書のステータス</a></h2>
<div class="outline-text-2" id="text-org1ba969d">
<ul class="org-ul">
<li>作成
<ul class="org-ul">
<li class="on"><input type='checkbox' checked='checked' /> 2024-03-24 貴島</li>
</ul></li>
<li>レビュー
<ul class="org-ul">
<li class="on"><input type='checkbox' checked='checked' /> 2024-04-27 貴島</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org83b9310" class="outline-2">
<h2 id="org83b9310"><a href="#org83b9310">概要</a></h2>
<div class="outline-text-2" id="text-org83b9310">
<p>
本はPDFで買うようにしていて、PDFはPCのブラウザ(Google Chrome)で読んでいる<sup><a id="fnr.1" class="footref" href="#fn.1">1</a></sup>。
</p>

<p>
1つ問題があって、リロードするとページがリセットされる。最初からになるので、ブラウザを閉じるときはページ番号をメモしたりしていた。不意にPCを再起動したりすると、どこまで読んだかわからなくなっていた。
</p>

<p>
最近見つけた解決策は、URLフラグメント <code>#</code> をつけるものだ。URLの末尾に <code>#page=31</code> をつけると、ChromeがPDFのそのページを開いてくれる。
</p>

<p>
たとえば、↓PDFをChromeで開くと10ページで開く。
</p>

<ul class="org-ul">
<li><a href="https://mozilla.github.io/pdf.js/web/compressed.tracemonkey-pldi-09.pdf#page=10">https://mozilla.github.io/pdf.js/web/compressed.tracemonkey-pldi-09.pdf#page=10</a> 👈末尾に注目</li>
</ul>

<p>
また、ズーム率もURLフラグメントで設定できる。
</p>

<p>
<a href="https://mozilla.github.io/pdf.js/web/compressed.tracemonkey-pldi-09.pdf#page=10&amp;zoom=150">https://mozilla.github.io/pdf.js/web/compressed.tracemonkey-pldi-09.pdf#page=10&amp;zoom=150</a>
</p>
</div>
</div>

<div id="outline-container-org9eacab7" class="outline-2">
<h2 id="org9eacab7"><a href="#org9eacab7">関連</a></h2>
<div class="outline-text-2" id="text-org9eacab7">
<p>
なし。
</p>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1">1</a></sup> <div class="footpara"><p class="footpara">
複数開くのをタブにまとめられて便利くらいの理由。
</p></div></div>


</div>
</div></div>
<div id="postamble" class="status">
<footer class="footer py-3"><div class="container"><div class="row "><div class="col-md-4"></div><div class="col-sm col-md"><nav class="navbar"><a class="nav-link text-secondary small px-0" href="./index.html">Insomnia</a><a class="nav-link text-secondary small px-0" href="./sitemap.html">Sitemap</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD/roam">Repository</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD">@kijimaD</a></nav></div><div class="col-md-4"></div></div></div></footer><script src="https://cdn.jsdelivr.net/npm/bootstrap@5.0.2/dist/js/bootstrap.bundle.min.js"/>
</div>
</body>
</html>
